# DpartOriginalCategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartOriginalCategoryId Property
ParameterTypeId Class See Also
---
"Original Category"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartOriginalCategoryId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartOriginalCategoryId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartOriginalCategoryId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace